import React, { Component } from 'react';
import Image from './Image'; // Імпортуємо компонент Image
import Kyiv from '../images/kyiv.png'; // Імпортуємо зображення

class Content extends Component {
    render() {
        return (
            <div>
                <p>Місце народження: 28 червня, 2005 року, м. Маріуполь</p>
                <p>Освіта: СЗШ №316</p>

                <p>Хоббі:</p>
                <ul>
                    <li>Великий теніс</li>
                    <li>Література</li>
                    <li>Іноземні мови</li>
                </ul>

                <p>Улюблені книги:</p>
                <ol>
                    <li>Чорна Рада</li>
                    <li>Тарас Бульба</li>
                    <li>Знак Зорро</li>
                </ol>

                <p>
                    Ки́їв — столиця та найбільше місто України. Розташований у середній течії Дніпра, у північній Наддніпрянщині.
                    Політичний, соціально-економічний, транспортний, освітньо-науковий, історичний, культурний та духовний центр
                    України.
                </p>

                {/* Використання компонента Image з шляхом до зображення */}
                <Image src={Kyiv} alt="Опис зображення" />
            </div>
        );
    }
}

export default Content;
